encryption/enumerate.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>http://103040106:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">{resource_uri}</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
        <a:MessageID>uuid:55F28C75-F63E-4F68-8360-A8C478003959</a:MessageID>
        <w:OperationTimeout>PT60.000S</w:OperationTimeout>
    </s:Header>
    <s:Body>
        <n:Enumerate>
            <w:OptimizeEnumeration />
            <w:MaxElements>32000</w:MaxElements>
            <w:Filter Dialect="http://schemas.microsoft.com/wbem/wsman/1/WQL">{wql}</w:Filter>
        </n:Enumerate>
    </s:Body>
</s:Envelope>
